app/views/tasks/_form.html.erb

SELECT "users".* FROM "users"
---
    <%= f.label :username %><br>
    <%= f.collection_select :id, User.all, :username, :id, prompt:true %>

SELECT "task_lists".* FROM "task_lists"
---
    <%= f.label :task_list_id %><br>
    <%= f.collection_select :task_list_id, TaskList.all, :id, :name, prompt:true %>