app/views/home/index.html.erb

<ul>
    <% User.find(session[:user_id]).tasks.each do | task | %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ?  [["user_id", 1]]