app/controllers/tasks_controller.rb

  def index
    @pending_tasks=Task.pending
    @completed_tasks =Task.completed.limit(5)
---
SELECT "tasks".* FROM "tasks"

  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("title", "description", "priority", "task_list_id", "due_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)