app/views/task_lists/show.html.erb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."task_list_id" = ?  [["task_list_id", 3]]
---
<ul>
  <%@task_list.tasks.each do |task|%>